# Етап 1: Вибір базового образу
# Ми беремо готовий, оптимізований образ Node.js версії 18.
FROM node:18-alpine

# Етап 2: Створення робочої директорії всередині контейнера
# Усі наступні команди будуть виконуватися в теці /app всередині контейнера.
WORKDIR /app

# Етап 3: Копіювання файлів для встановлення залежностей
# Це прискорює майбутні збірки, оскільки залежності перевстановлюються,
# тільки якщо package.json змінився.
COPY package*.json ./

# Етап 4: Встановлення залежностей проєкту
RUN npm install
RUN apk add --no-cache ca-certificates
# Етап 5: Копіювання решти коду проєкту
# Копіюємо весь код з нашої теки в робочу теку /app контейнера.
COPY . .

# Етап 6: Відкриття порту
# Повідомляємо Docker, що наш застосунок буде слухати порт 3000.
EXPOSE 3000

# Етап 7: Команда для запуску
# Ця команда виконається, коли контейнер стартує.
# Ми ще створимо файл index.js.
CMD ["node", "src/index.js"]